#Область Форма

#Область События

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЭтаОбработка = ЭтаОбработка();
	Элементы.НадписьНомерВерсии.Заголовок = ЭтаОбработка().НомерВерсииОбработки();
	
КонецПроцедуры

#КонецОбласти

#Область Команды

&НаКлиенте
Процедура КомандаЗакрыть(Команда)
	
	Закрыть();
	
КонецПроцедуры

#КонецОбласти

#Область Элементы

&НаКлиенте
Процедура НадписьПисьмоРазработчикуНажатие(Элемент)
	
	ЗапуститьПриложение("mailto:o.nikolaev@bk.ru");
	
КонецПроцедуры

&НаКлиенте
Процедура НадписьАдресСтраницыРазработкиНажатие(Элемент)
	ЗапуститьПриложение("https://infostart.ru/public/340311/");
КонецПроцедуры

&НаКлиенте
Процедура НадписьСтраницаРазработкиНаGitHubНажатие(Элемент)
	ЗапуститьПриложение("https://github.com/oNikolaev/nv1c");
КонецПроцедуры

&НаКлиенте
Процедура НадписьПисьмоВСлужбуПоддержкиНажатие(Элемент)
	
	ЗапуститьПриложение("mailto:navigator.sprt@bk.ru");
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область Функции

&НаСервере
Функция ЭтаОбработка()
	Возврат РеквизитФормыВЗначение("Объект");
КонецФункции

#КонецОбласти
