// Имя списка элементов, табличной части, таблицы движений по связанной с ним команде.
//
// Параметры:
//	ИмяЭлементаКоманды - Строка, имя команды (например: "Команда_Закрыть_Список_Справочники_Справочник_ДоговорыКонтрагентов_2").
//
// Возвращаемое значение:
//	Строка. Имя элемента-списка (например: "Список_Справочники_Справочник_ДоговорыКонтрагентов_2").
//
Функция ИмяСпискаПоИмениКоманды(ИмяЭлементаКоманды) Экспорт
	
	Результат = "";
	ПустойРезультат = "";
	
	#Область Предусловия
	
	Если Не ЗначениеЗаполнено(ИмяЭлементаКоманды) Тогда
		Возврат ПустойРезультат;
	КонецЕсли;
	
	#КонецОбласти
	
	РЧИ = РазделительЧастейИмен();
	
	ЧастиСтроки = НВ_СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(
		ИмяЭлементаКоманды, 
		РЧИ
	);
	
	ТипСписка = ЧастиСтроки[2];
	
	Если ТипСписка = "ТабличнаяЧасть" Тогда
		
		ИмяСписка = НВ_СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			"%1"
			+ РЧИ + "%2"
			, ЧастиСтроки[2], ЧастиСтроки[3]
		);
		
	ИначеЕсли ТипСписка = "РегистрНакопления" Или ТипСписка = "РегистрСведений" Или ТипСписка = "РегистрРасчета" Или ТипСписка = "РегистрБухгалтерии" Тогда
		
		ИмяСписка = НВ_СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			"%1"
			+ РЧИ + "%2"
			, ЧастиСтроки[2], ЧастиСтроки[3]
		);
		
	Иначе
		
		ИмяСписка = НВ_СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			"Список"
			+ РЧИ + "%1"
			+ РЧИ + "%2"
			+ РЧИ + "%3"
			+ РЧИ
			+ "%4", ЧастиСтроки[3], ЧастиСтроки[4], ЧастиСтроки[5], ЧастиСтроки[6]
		);
		
	КонецЕсли;
	
	Результат = ИмяСписка;
	
	Возврат Результат;
	
КонецФункции

// Параметры табличной части, таблицы движений по связанной с ним команде.
//
// Параметры:
//	ИмяЭлементаКоманды - Строка, имя команды 
//		(например: "Команда_777_РедактированиеЗаписи_777_Список_777_РегистрыСведений_777_РегистрСведений_777_ЦеныТоваров_777_2").
//
// Возвращаемое значение:
//	Структура. Параметры таблицы объекта (табличной части, связанного набора движений).
//
Функция ПараметрыТаблицыПоИмениКоманды(ИмяЭлементаКоманды) Экспорт
	
	Результат       = Тип_ПараметрыТаблицыПоИмениКоманды();
	ПустойРезультат = Неопределено;
	
	#Область Предусловия
	
	Если Не ЗначениеЗаполнено(ИмяЭлементаКоманды) Тогда
		Возврат ПустойРезультат;
	КонецЕсли;
	
	#КонецОбласти
	
	РЧИ = РазделительЧастейИмен();
	
	ЧастиСтроки = НВ_СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(
		ИмяЭлементаКоманды, 
		РЧИ
	);
	
	Результат.ТипТаблиц = ЧастиСтроки[3];
	Результат.ТипТаблицы = ЧастиСтроки[4];
	Результат.ИмяТаблицы = ЧастиСтроки[5];
	
	Возврат Результат;
	
КонецФункции

Функция РазделительЧастейИмен() Экспорт
	
	Возврат "_777_";
	
КонецФункции

Функция Тип_ПараметрыТаблицыПоИмениКоманды()
	
	Результат = Новый Структура("ТипТаблицы, ИмяТаблицы");
	Результат.Вставить("ТипТаблиц", ""); // "РегистрыСведений"
	Результат.Вставить("ТипТаблицы", ""); // "РегистрСведений"
	Результат.Вставить("ИмяТаблицы", ""); // "ЦеныТоваров"
	
	Возврат Результат;
	
КонецФункции
