// Параметры табличной части, таблицы движений по связанной с ним команде.
//
// Параметры:
//	ИмяЭлементаКоманды - Строка, имя команды (например: "Команда_Закрыть_Список_Справочники_Справочник_ДоговорыКонтрагентов_2").
//
// Возвращаемое значение:
//	Структура. Параметры таблицы объекта (табличной части, связанного набора движений).
//
Функция ПараметрыТаблицыПоИмениКоманды(ИмяЭлементаКоманды) Экспорт
	
	Результат       = Тип_ПараметрыТаблицыПоИмениКоманды();
	ПустойРезультат = Неопределено;
	
	#Область Предусловия
	
	Если Не ЗначениеЗаполнено(ИмяЭлементаКоманды) Тогда
		Возврат ПустойРезультат;
	КонецЕсли;
	
	#КонецОбласти
	
	РЧИ = РазделительЧастейИмен();
	
	ЧастиСтроки = НВ_СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(
		ИмяЭлементаКоманды, 
		РЧИ
	);
	
	ТипТаблицы = ЧастиСтроки[2];
	ИмяТаблицы = ЧастиСтроки[3];
	
	Результат.ТипТаблицы = ТипТаблицы;
	Результат.ИмяТаблицы = ИмяТаблицы;
	
	Возврат Результат;
	
КонецФункции

Функция РазделительЧастейИмен() Экспорт
	
	Возврат "_777_";
	
КонецФункции

Функция Тип_ПараметрыТаблицыПоИмениКоманды()
	
	Результат = Новый Структура("ТипТаблицы, ИмяТаблицы");
	Результат.Вставить("ТипТаблицы", "");
	Результат.Вставить("ИмяТаблицы", "");
	
	Возврат Результат;
	
КонецФункции
