#Область Форма

#Область События

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЭтаОбработка = ЭтаОбработка();
	
	Для каждого ОбъектМд Из Метаданные.Константы Цикл
		
		СтрокаТбл = ЗначенияКонстант.Добавить();
		СтрокаТбл.ЗначенияКонстантИмя = ОбъектМд.Имя;
		СтрокаТбл.ЗначенияКонстантСиноним = ОбъектМд.Синоним;
		СтрокаТбл.ЗначенияКонстантКомментарий = ОбъектМд.Комментарий;
		
		СтрокаТбл.ЗначенияКонстантТипЗначения = ОбъектМд.Тип;
		
		СтрокаТбл.ЗначенияКонстантЗначение = Константы[ОбъектМд.Имя].Получить();
		СтрокаТбл.ЗначенияКонстантТипЗначенияПредставление = ЭтаОбработка.СтрокаОписанияТипов(ОбъектМд.Тип); // ОбъектМд.Тип;
		СтрокаТбл.ЗначенияКонстантУдалить = Врег(Лев(ОбъектМд.Имя, СтрДлина("Удалить"))) = Врег("Удалить");
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если Источник = "Навигатор" Тогда
		
		Если ИмяСобытия = "ЗакрытьВсеОкнаРедакторов" Тогда
			Закрыть();
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область Элементы
#КонецОбласти

#Область Таблицы

#Область ЗначенияКонстант

&НаКлиенте
Процедура ЗначенияКонстантВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Попытка
		ПараметрыФормы = Новый Структура("ОбъектБазы", Элемент.ТекущиеДанные["ЗначенияКонстантЗначение"]);
	Исключение
		Возврат;
	КонецПопытки;
	
	ПолноеИмяФормы = ПолноеИмяФормыОбработки(ЭтаФорма.ИмяФормы, "РедакторОбъекта");
	ОткрытьФорму(ПолноеИмяФормы, ПараметрыФормы, ЭтаФорма, Истина);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецОбласти

#Область Подключаемые
#КонецОбласти

#Область Процедуры
#КонецОбласти

#Область Функции

&НаСервере
Функция ПолноеИмяФормыОбработки(ИмяТекущейФормы, ИмяФормыОбработки)
	
	Результат = ЭтаОбработка().ПолноеИмяФормыОбработки(ИмяТекущейФормы, ИмяФормыОбработки);
	
	Возврат Результат; 
	
КонецФункции

&НаСервере
Функция ЭтаОбработка()
	
	Результат = РеквизитФормыВЗначение("Объект");
	Возврат Результат;
	
КонецФункции

#КонецОбласти

